backend-api/backend-api/backend-api/app/Controllers/AuthController.php

    public function login()
    {
        // 1. Mengambil data JSON input dari Frontend VueJS / Axios
        $json = $this->request->getJSON();

        if (!$json || empty($json->username) || empty($json->password)) {
            return $this->respond([
                'status'  => 400,
                'message' => 'Username dan password wajib diisi!'
            ], 400);
        }

        $username = trim($json->username);
        $password = $json->password;

        // 2. Mencari user di database berdasarkan username
        $db   = \Config\Database::connect();
        $user = $db->table('users')->getWhere(['username' => $username])->getRow();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'

        $token = 'KODETOKENSUPERAMANADMIN';

        // 5. Simpan Token tersebut ke database pada baris user yang bersangkutan
        $db->table('users')->where('id', $user->id)->update(['token' => $token]);
---
UPDATE `users` SET `token` = 'KODETOKENSUPERAMANADMIN'
WHERE `id` = '1'