backend-api/backend-api/backend-api/app/Controllers/BukuController.php

SELECT `buku`.*, `kategori`.`nama_kategori`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id` = `buku`.`kategori_id`
---
    public function index()
    {
        // Melakukan JOIN ke tabel kategori untuk mengambil nama kategori genre buku
        $data = $this->model->select('buku.*, kategori.nama_kategori')
                            ->join('kategori', 'kategori.id = buku.kategori_id', 'left')
                            ->findAll();

SELECT `peminjaman`.*, `buku`.`judul`
FROM `peminjaman`
LEFT JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
ORDER BY `tanggal_pinjam` DESC
---
    public function getPeminjaman()
    {
        $db = \Config\Database::connect();

        // Mengambil log peminjaman dengan data judul buku
        $data = $db->table('peminjaman')
                   ->select('peminjaman.*, buku.judul')
                   ->join('buku', 'buku.id = peminjaman.buku_id', 'left')
                   ->orderBy('tanggal_pinjam', 'DESC')
                   ->get()
                   ->getResultArray();

SELECT *
FROM `buku`
WHERE `buku`.`id` = '23'
INSERT INTO `peminjaman` (`buku_id`, `nama_peminjam`, `tanggal_pinjam`, `status`) VALUES ('23', 'fffffff', '2026-06-19', 'Dipinjam')
UPDATE `buku` SET `stok` = 9
WHERE `buku`.`id` IN ('23')
---
    public function pinjam()
    {
        $db = \Config\Database::connect();

        $json = $this->request->getJSON();

        $bukuId       = $json->buku_id ?? null;
        $namaPeminjam = $json->nama_peminjam ?? 'Pembaca Umum';

        if (!$bukuId) {
            return $this->_addCORSHeaders($this->fail('ID Buku tidak boleh kosong.', 400));
        }

        $buku = $this->model->find($bukuId);

        if (!$buku || (int)$buku['stok'] <= 0) {
            return $this->_addCORSHeaders($this->fail('Maaf, stok komik ini sudah habis atau tidak ditemukan!', 400));
        }

        $db->transStart();

        $db->table('peminjaman')->insert([
            'buku_id'        => $bukuId,
            'nama_peminjam'  => $namaPeminjam,
            'tanggal_pinjam' => date('Y-m-d'),
            'status'         => 'Dipinjam'
        ]);

        $this->model->update($bukuId, [
            'stok' => (int)$buku['stok'] - 1
        ]);