backend-api/backend-api/backend-api/app/Controllers/KategoriController.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('kategori');
        $data = $builder->get()->getResult();